/*
* uddesc.h                                                  Version 2.53
*
* smxUSBD Descriptor Definition.
*
* Copyright (c) 2005-2011 Micro Digital Inc.
* All rights reserved. www.smxrtos.com
*
* This software is confidential and proprietary to Micro Digital Inc.
* It has been furnished under a license and may be used, copied, or
* disclosed only in accordance with the terms of that license and with
* the inclusion of this header. No title to nor ownership of this
* software is hereby transferred.
*
* Author: Yingbo Hu
*
* Portable to any ANSI compliant C compiler.
*
*****************************************************************************/

#ifndef SUD_DESC_H
#define SUD_DESC_H

#ifdef __cplusplus
extern "C" {
#endif

#if __packed_pragma
#pragma pack(1)  /* pack structures (byte alignment) */
#endif

typedef __packed struct {
    u8  bmRequestType;
    u8  bRequest;
    u16 wValue;
    u16 wIndex;
    u16 wLength;
} __packed_gnu SUD_DEV_REQUESTSTRU_T;

#define SUD_SIZEOF_REQUEST_HEAD     8

/* standard usb descriptor structures */

#if SUD_COMPOSITE || SUD_AUDIO || SUD_VIDEO
typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;    /* 0x0B */
    u8  bFirstInterface;
    u8  bInterfaceCount;
    u8  bFunctionClass;
    u8  bFunctionSubClass;
    u8  bFunctionProtocol;
    u8  iFunction;
} __packed_gnu SUD_IAD_DESC_T; /* Interface Association Descriptor */

#define SUD_SIZEOF_IAD_DESC     8

#endif /* SUD_COMPOSITE */

typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;    /* 0x9 */
    u8  bmAttributes;
} __packed_gnu SUD_OTG_DESC_T;

#define SUD_SIZEOF_OTG_DESC     3

typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;    /* 0x06 */
    u16 bcdUSB;
    u8  bDeviceClass;
    u8  bDeviceSubClass;
    u8  bDeviceProtocol;
    u8  bMaxPacketSize0;
    u8  bNumConfigurations;
    u8  bReserved;
} __packed_gnu SUD_DEV_QUALIFIER_DESC_T;

#define SUD_SIZEOF_DEV_QUALIFIER_DESC     10

typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;    /* 0x5 */
    u8  bEndpointAddress;
    u8  bmAttributes;
    u16 wMaxPacketSize;
    u8  bInterval;
} __packed_gnu SUD_ENDPOINT_DESC_T;

#define SUD_SIZEOF_ENDPOINT_DESC     7

typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;    /* 0x04 */
    u8  bInterfaceNumber;
    u8  bAlternateSetting;
    u8  bNumEndpoints;
    u8  bInterfaceClass;
    u8  bInterfaceSubClass;
    u8  bInterfaceProtocol;
    u8  iInterface;
} __packed_gnu SUD_INTERFACE_DESC_T;

#define SUD_SIZEOF_INTERFACE_DESC     9

typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;    /* 0x2 */
    u16 wTotalLength;
    u8  bNumInterfaces;
    u8  bConfigurationValue;
    u8  iConfiguration;
    u8  bmAttributes;
    u8  bMaxPower;
} __packed_gnu SUD_CONFIGURATION_DESC_T;

#define SUD_SIZEOF_CONFIGURATION_DESC     9

typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;    /* 0x01 */
    u16 bcdUSB;
    u8  bDeviceClass;
    u8  bDeviceSubClass;
    u8  bDeviceProtocol;
    u8  bMaxPacketSize0;
    u16 idVendor;
    u16 idProduct;
    u16 bcdDevice;
    u8  iManufacturer;
    u8  iProduct;
    u8  iSerialNumber;
    u8  bNumConfigurations;
} __packed_gnu SUD_DEVICE_DESC_T;

#define SUD_SIZEOF_DEVICE_DESC     18

typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;
    u8  bDataItem[2];
} __packed_gnu SUD_STRING_DESC_T;

#define SUD_SIZEOF_STRING_DESC     4

typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
} __packed_gnu SUD_GENERIC_DESC_T;

typedef __packed struct {
    union {
        SUD_GENERIC_DESC_T GenericDesc;
        SUD_ENDPOINT_DESC_T EndpointDesc;
        SUD_INTERFACE_DESC_T InterfaceDesc;
        SUD_CONFIGURATION_DESC_T ConfigurationDesc;
        SUD_DEVICE_DESC_T DeviceDesc;
        SUD_STRING_DESC_T StringDesc;
        SUD_DEV_QUALIFIER_DESC_T DevQualifierDesc;
#if SUD_COMPOSITE || SUD_AUDIO || SUD_VIDEO
        SUD_IAD_DESC_T IADDesc;
#endif
    } __packed_gnu Descriptor;

} __packed_gnu SUD_DESCRIPTOR_T;


/* communications class descriptor structures. CDC 5.2 Table 25c */

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
} __packed_gnu SUD_CLASS_FUNCTION_DESC_T;

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u8  bmCapabilities;
} __packed_gnu SUD_CLASS_FUNCTION_GENERIC_DESC_T;

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x00 */
    u16 bcdCDC;
} __packed_gnu SUD_CLASS_HEADER_FUNCTION_DESC_T;

#define SUD_SIZEOF_CDC_HEADER_DESC 5

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x01 */
    u8  bmCapabilities;
    u8  bDataInterface;
} __packed_gnu SUD_CLASS_CALL_MANAGEMENT_DESC_T;

#define SUD_SIZEOF_CDC_CM_DESC 5

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x02 */
    u8  bmCapabilities;
} __packed_gnu SUD_CLASS_ACM_DESC_T;

#define SUD_SIZEOF_CDC_ACM_DESC 4

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x03 */
} __packed_gnu SUD_CLASS_DIRECT_LINE_DESC_T;

#define SUD_SIZEOF_CDC_DIRECT_LINE_DESC 3

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x04 */
    u8  bRingerVolSeps;
    u8  bNumRingerPatterns;
} __packed_gnu SUD_CLASS_TELE_RINGER_DESC_T;

#define SUD_SIZEOF_CDC_TELE_RINGER_DESC 5

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x05 */
    u8  bmCapabilities;
} __packed_gnu SUD_CLASS_TELE_CALL_DESC_T;

#define SUD_SIZEOF_CDC_TELE_CALL_DESC 4

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x06 */
    u8  bMasterInterface;
    u8  bSlaveInterface0[1];
} __packed_gnu SUD_CLASS_UNION_FUNCTION_DESC_T;

#define SUD_SIZEOF_CDC_UF_DESC 5

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x07 */
    u8  iCountryCodeRelDate;
    u16 wCountryCode0[1];
} __packed_gnu SUD_CLASS_COUNTRY_SELECT_DESC_T;

#define SUD_SIZEOF_CDC_COUNTRY_SELECT_DESC 6

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x08 */
    u8  bmCapabilities;
} __packed_gnu SUD_CLASS_TELE_OPER_DESC_T;

#define SUD_SIZEOF_CDC_TELE_OPER_DESC 4

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x09 */
    u8  bEntityId;
    u8  bInterfaceNo;
    u8  bOutInterfaceNo;
    u8  bmOptions;
    u8  bChild0[1];
} __packed_gnu SUD_CLASS_TERMINAL_DESC_T;

#define SUD_SIZEOF_CDC_TERMINAL_DESC 8

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x0a */
    u8  bEntityId;
    u8  iName;
    u8  bChannelIndex;
    u8  bPhysicalInterface;
} __packed_gnu SUD_CLASS_NET_CHANNEL_DESC_T;

#define SUD_SIZEOF_CDC_NET_CHANNEL_DESC 7

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x0b */
    u8  bEntityId;
    u8  bProtocol;
    u8  bChild0[1];
} __packed_gnu SUD_CLASS_PROTO_UNIT_FUNCTION_DESC_T;

#define SUD_SIZEOF_CDC_PROTO_UF_DESC 6

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x0c */
    u8  bEntityId;
    u8  bExtensionCode;
    u8  iName;
    u8  bChild0[1];
} __packed_gnu SUD_CLASS_EXTENSION_UNIT_DESC_T;

#define SUD_SIZEOF_CDC_EXTENSION_UNIT_DESC 7

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x0d */
    u8  bmCapabilities;
} __packed_gnu SUD_CLASS_MULTI_CHANNEL_DESC_T;

#define SUD_SIZEOF_CDC_MULTI_CHANNEL_DESC 4

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x0e */
    u8  bmCapabilities;
} __packed_gnu SUD_CLASS_CAPI_CONTROL_DESC_T;

#define SUD_SIZEOF_CDC_CAPI_CONTROL_DESC 4

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x0f */
    u8  iMACAddress;
    u32 bmEthernetStatistics;
    u16 wMaxSegmentSize;
    u16 wNumberMCFilters;
    u8  bNumberPowerFilters;
} __packed_gnu SUD_CLASS_ETHERNET_DESC_T;

#define SUD_SIZEOF_CDC_ETHERNET_DESC 13

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x10 */
    u8  iEndSystermIdentifier;
    u8  bmDataCapabilities;
    u8  bmATMDeviceStatistics;
    u16 wType2MaxSegmentSize;
    u16 wType3MaxSegmentSize;
    u16 wMaxVC;
} __packed_gnu SUD_CLASS_ATM_DESC_T;

#define SUD_SIZEOF_CDC_ATM_DESC 12

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x12 */
    u16 bcdVersion;
    u8  bGUID[16];
} __packed_gnu SUD_CLASS_MDLM_DESC_T;

#define SUD_SIZEOF_CDC_MDLM_DESC 21

typedef __packed struct {
    u8  bFunctionLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;    /* 0x13 */
    u8  bGuidDescriptorType;
    u8  bDetailData[1];
} __packed_gnu SUD_CLASS_MDLMD_DESC_T;

#define SUD_SIZEOF_CDC_MDLMD_DESC 5

/* HID class descriptor structures. HID 6.2.1 */

typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;
    u16 bcdVersion;
    u8  bCountryCode;
    u8  bNumDescriptors;    /* 0x01 */
    u8  bDescriptorType0;
    u8  bDescriptorLength0;
    u8  bDescriptorLength1;
    /* optional descriptors are not supported. */
} __packed_gnu SUD_CLASS_HID_DESC_T;

#define SUD_SIZEOF_HID_DESC    9

typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;
    u16 wLength;
    u8  bData[2];
} __packed_gnu SUD_CLASS_REPORT_DESC_T;

#define SUD_SIZEOF_REPORT_DESC    6

/* Audio class descriptor structures. */
/* AC descriptor */
typedef __packed struct { /* Table 4-2 */
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u16 bcdADC;
    u16 wTotalLength;
    u8  bInCollection;
    u8  baInterfaceNr[1]; /* real size is sizeof(SUD_CLASS_AC_HEADER_DESC_T) + (bInCollection - 1) */
} __packed_gnu SUD_CLASS_AC_HEADER_DESC_T;

#define SUD_SIZEOF_AC_HEADER_DESC 9

typedef __packed struct { /* Table 4-3 */
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u8  bTerminalID;
    u16 wTerminalType;
    u8  bAssocTerminal;
    u8  bNrChannels;
    u16 wChannelConfig;
    u8  iChannelNames;
    u8  iTerminal;
} __packed_gnu SUD_CLASS_AC_IT_DESC_T;

#define SUD_SIZEOF_AC_IT_DESC 12

typedef __packed struct { /* Table 4-4 */
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u8  bTerminalID;
    u16 wTerminalType;
    u8  bAssocTerminal;
    u8  bSourceID;
    u8  iTerminal;
} __packed_gnu SUD_CLASS_AC_OT_DESC_T;

#define SUD_SIZEOF_AC_OT_DESC 9

/* Audio Feature Unit Descriptor */
typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u8  bUnitID;
    u8  bSourceID;
    u8  bControlSize;
    u8  bmaControls[1];
    /* u8  iFeature; */ /* real size is sizeof(SUD_CLASS_AC_FU_DESC_T) + (Channel*bControlSize) */
} __packed_gnu SUD_CLASS_AC_FU_DESC_T;

#define SUD_SIZEOF_AC_FU_DESC 7

typedef __packed struct {
    u8  bNrChannels;
    u16 wChannelConfig;
    u8  iChannelNames;
    u8  bmControls[1];
    /*u8  iMixer;*/
} __packed_gnu SUD_CLASS_AC_MIXER_CHANNEL_DESC_T;

#define SUD_SIZEOF_AC_MIXER_CHANNEL_DESC 5

/* Audio Mixer Unit Descriptor */
typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u8  bUnitID;
    u8  bNrInPins;
    u8  bSourceID[1];
    /*
    u8  bNrChannels;
    u16 wChannelConfig;
    u8  iChannelNames;
    u8  bmControls[];
    u8  iMixer;
    */
} __packed_gnu SUD_CLASS_AC_MIXER_DESC_T; /* real size is sizeof(SUD_CLASS_AC_MIXER_DESC_T) + 2*bNrInPins - 1 + sizeof(SUD_CLASS_AC_MIXER_CHANNEL_DESC_T) */

#define SUD_SIZEOF_AC_MIXER_DESC 6

/* Audio Selector Unit Descriptor */
typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u8  bUnitID;
    u8  bNrInPins;
    u8  baSourceID[1];
    /*u8  iSelector; */ /* real size is sizeof(SUD_CLASS_AC_SELECTOR_DESC_T) + (bNrInPins) */
} __packed_gnu SUD_CLASS_AC_SELECTOR_DESC_T;

#define SUD_SIZEOF_AC_SELECTOR_DESC 6

/* AS descriptor */
typedef __packed struct { /* Table 4-19 */
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u8  bTerminalLink;
    u8  bDelay;
    u16 wFormatTag;
} __packed_gnu SUD_CLASS_AS_GENERAL_DESC_T;

#define SUD_SIZEOF_AS_GENERAL_DESC 7

/* Type I format descriptor, Table 2-1 */
typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u8  bFormatType;
    u8  bNrChannels;
    u8  bSubFrameSize;
    u8  bBitResolution;
    u8  bSamFreqType;
    u8  tSamFreq[1][3];/* real size is sizeof(SUD_CLASS_AC_SELECTOR_DESC_T) + (bSamFreqType -1)*3 */
} __packed_gnu SUD_CLASS_AS_FORMAT_TYPEI_DESC_T;

#define SUD_SIZEOF_AS_FORMAT_TYPEI_DESC 11

/* Audio Class-Specific AS Isochronous Audio Data Endpoint Descriptor */
typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u8  bmAttributes;
    u8  bLockDelayUnits;
    u16 wLockDelay;
} __packed_gnu SUD_CLASS_AS_ENDPOINT_DESC_T;

#define SUD_SIZEOF_AS_ENDPOINT_DESC 7

/* Audio Endpoint Descriptor, Two bytes extension */
typedef __packed struct {
    u8  bLength;
    u8  bDescriptorType;    /* 0x5 */
    u8  bEndpointAddress;
    u8  bmAttributes;
    u16 wMaxPacketSize;
    u8  bInterval;
    u8  bFresh;
    u8  bSynchAddress;
} __packed_gnu SUD_ENDPOINT_AUDIO_DESC_T;


/* MS descriptor */
/* MS Interface Header Descriptor */
typedef __packed struct { /* Table 6-2 */
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u16 bcdMSC;
    u16 wTotalLength;
} __packed_gnu SUD_CLASS_MS_HEADER_DESC_T;

#define SUD_SIZEOF_MS_HEADER_DESC 7

/* MIDI IN Jack Descriptor */
typedef __packed struct { /* Table 6-3 */
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u8  bJackType;
    u8  bJackID;
    u8  iJack;
} __packed_gnu SUD_CLASS_MIDI_IN_DESC_T;

#define SUD_SIZEOF_MIDI_IN_DESC 6

/* MIDI OUT Jack Descriptor */
typedef __packed struct { /* Table 6-4 */
    u8  bLength;
    u8  bDescriptorType;
    u8  bDescriptorSubtype;
    u8  bJackType;
    u8  bJackID;
    u8  bNrInputPins;
    u8  baSourceID[1];
